"""Module with text for answers to user's place suggestion"""
CANCEL = """Запрос на добавление места отменён
Чтобы вернуться к боту-экскурсоводу, напиши команду
/start
"""

FIR_ANS = """Круто, что ты решил помочь нам!

Чтобы предложить новое место, для начала нужно выбрать один из районов, приведённых ниже 🏙️

 Отменить предложение нового места можно в любой момент, написав \"отмена\" (без кавычек)"""

SEC_ANS = """Отлично, район выбран!

    Теперь напишите название места, которое хотите предложить"""

TH_ANS = (
    "✅ Название сохранено \n\n"
    "🔹 Шаг 3 из 5 – напишите описание места 📝\n\n"
    "Расскажите подробно:\n"
    "• Чем интересно это место?\n"
    "• Что там можно увидеть/сделать?\n"
    "• Для кого оно подходит? 👥\n"
    "• Есть ли особенности посещения? ⏰\n\n"
    "Чем подробнее и интереснее описание, тем выше шанс одобрения!"
)

FOUR_ANS = """Отлично, описание места добавлено!

Дальше нам нужна ссылка в 2ГИС-е на это место (можно просто скопировать из 2ГИС-а) 🗺️"""

FIF_ANS = """Ссылка успешно добавлена!

Было бы здорово, если бы Вы добавили одну фотографию этого места 📸, но если нет,\
то можно написать \"Нет фотографии\" или нажать на одноимённую кнопку на Вашей клавиатуре

Учтите, что без фотографии шанс того, что Ваше место добавят, меньше"""

SIX_ANS = (
    "📸 Фото получено, отличный кадр!\n"
    "Это повышает шансы на одобрение вашего места!"
)

SEV_ANS = """Отлично! Ваше место отправлено на рассмотрение

Спасибо за помощь в создании нашей карты достопримечательностей!"""
